//
//  m3_code.c
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#ਅਨ੍ਤਰ੍ਭਾਵ <limits.h>
#ਅਨ੍ਤਰ੍ਭਾਵ "m3_code.h"
#ਅਨ੍ਤਰ੍ਭਾਵ "m3_env.h"

//---------------------------------------------------------------------------------------------------------------------------------


IM3_ਕੋਡ_ਪੰਨਾ New_ਕੋਡ_ਪੰਨਾ (IM3Runtime i_runtime, u32 i_min_ਅੰਕ_ਸਤਰਾਂ)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਪੰਨਾ;

    // check multiplication overflow
    ਜੇ (i_min_ਅੰਕ_ਸਤਰਾਂ > UINT_MAX / ਆਕਾਰ(ਕੋਡ_t)) {
        ਵਾਪਸ ਨਿਰਾ;
    }
    u32 ਪੰਨਾ_ਮਾਪ = ਆਕਾਰ(M3_ਕੋਡ_ਪੰਨਾ_ਸਿਰਲੇਖ) + ਆਕਾਰ(ਕੋਡ_t) * i_min_ਅੰਕ_ਸਤਰਾਂ;

    // check addition overflow
    ਜੇ (ਪੰਨਾ_ਮਾਪ < ਆਕਾਰ(M3_ਕੋਡ_ਪੰਨਾ_ਸਿਰਲੇਖ)) {
        ਵਾਪਸ ਨਿਰਾ;
    }

    ਪੰਨਾ_ਮਾਪ = (ਪੰਨਾ_ਮਾਪ + (d_m3_ਕੋਡ_ਪੰਨਾ_Align_ਮਾਪ - 1)) & ~(d_m3_ਕੋਡ_ਪੰਨਾ_Align_ਮਾਪ - 1); // align
    // check alignment overflow
    ਜੇ (ਪੰਨਾ_ਮਾਪ == 0) {
        ਵਾਪਸ ਨਿਰਾ;
    }

    ਪੰਨਾ = (IM3_ਕੋਡ_ਪੰਨਾ)m3_Malloc("M3CodePage", ਪੰਨਾ_ਮਾਪ);

    ਜੇ (ਪੰਨਾ) {
        ਪੰਨਾ->info.sequence = ++i_runtime->new_ਕੋਡ_ਪੰਨਾ_Sequence;
        ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ = (ਪੰਨਾ_ਮਾਪ - ਆਕਾਰ(M3_ਕੋਡ_ਪੰਨਾ_ਸਿਰਲੇਖ)) / ਆਕਾਰ(ਕੋਡ_t);

#ਜੇ d_m3_ਰਿਕਾਰਡ_Backtraces
        u32 ਪੰਨਾ_ਮਾਪ_Bt     = ਆਕਾਰ(M3_ਕੋਡ_Mapping_ਪੰਨਾ) + ਆਕਾਰ(M3_ਕੋਡ_Map_ਇੰਦਰਾਜ) * ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ;
        ਪੰਨਾ->info.mapping = (M3_ਕੋਡ_Mapping_ਪੰਨਾ*)m3_Malloc("M3CodeMappingPage", ਪੰਨਾ_ਮਾਪ_Bt);

        ਜੇ (ਪੰਨਾ->info.mapping) {
            ਪੰਨਾ->info.mapping->ਮਾਪ     = 0;
            ਪੰਨਾ->info.mapping->ਸਮਰੱਥਾ = ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ;
        } ਨਹੀਂਤਾਂ {
            m3_Free(ਪੰਨਾ);
            ਵਾਪਸ ਨਿਰਾ;
        }
        ਪੰਨਾ->info.mapping->ਅਧਾਰ_PC = Get_ਪੰਨਾ_ਸ਼ੁਰੂ_PC(ਪੰਨਾ);
#ਜੇ_ਅੰਤ // d_m3RecordBacktraces

        m3log(runtime, "new page: %p; seq: %d; bytes: %d; lines: %d", Get_ਪੰਨਾ_PC(ਪੰਨਾ), ਪੰਨਾ->info.sequence, ਪੰਨਾ_ਮਾਪ, ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);
    }

    ਵਾਪਸ ਪੰਨਾ;
}


ਖਾਲੀ Free_ਕੋਡ_ਪੰਨੇ (IM3_ਕੋਡ_ਪੰਨਾ* io_list)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਪੰਨਾ = *io_list;

    ਜਦੋਂ (ਪੰਨਾ) {
        m3log(ਕੋਡ, "free page: %d; %p; util: %3.1f%%", ਪੰਨਾ->info.sequence, ਪੰਨਾ, 100. * ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ / ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);

        IM3_ਕੋਡ_ਪੰਨਾ ਅਗਲਾ = ਪੰਨਾ->info.ਅਗਲਾ;
#ਜੇ d_m3_ਰਿਕਾਰਡ_Backtraces
        m3_Free(ਪੰਨਾ->info.mapping);
#ਜੇ_ਅੰਤ // d_m3RecordBacktraces
        m3_Free(ਪੰਨਾ);
        ਪੰਨਾ = ਅਗਲਾ;
    }

    *io_list = ਨਿਰਾ;
}


u32 ਅੰਕ_Free_ਸਤਰਾਂ (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ)
{
    d_m3Assert(i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ <= i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);

    ਵਾਪਸ i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ - i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ;
}


ਖਾਲੀ Emit_ਸ਼ਬਦ_impl (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, ਖਾਲੀ* i_ਸ਼ਬਦ)
{                                                                       d_m3Assert (i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ+1 <= i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);
    i_ਪੰਨਾ->ਕੋਡ[i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ++] = i_ਸ਼ਬਦ;
}

ਖਾਲੀ EmitWord32 (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, ਅਚਲ u32 i_ਸ਼ਬਦ)
{                                                                       d_m3Assert (i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ+1 <= i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);
    ਸਮ੍ਰਿਤੀ_ਨਕਲ(&i_ਪੰਨਾ->ਕੋਡ[i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ++], &i_ਸ਼ਬਦ, ਆਕਾਰ(i_ਸ਼ਬਦ));
}

ਖਾਲੀ EmitWord64 (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, ਅਚਲ u64 i_ਸ਼ਬਦ)
{
#ਜੇ M3_SIZEOF_PTR == 4
                                                                        d_m3Assert (i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ+2 <= i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);
    ਸਮ੍ਰਿਤੀ_ਨਕਲ(&i_ਪੰਨਾ->ਕੋਡ[i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ], &i_ਸ਼ਬਦ, ਆਕਾਰ(i_ਸ਼ਬਦ));
    i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ += 2;
#ਨਹੀਂਤਾਂ
                                                                        d_m3Assert (i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ+1 <= i_ਪੰਨਾ->info.ਅੰਕ_ਸਤਰਾਂ);
    ਸਮ੍ਰਿਤੀ_ਨਕਲ(&i_ਪੰਨਾ->ਕੋਡ[i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ], &i_ਸ਼ਬਦ, ਆਕਾਰ(i_ਸ਼ਬਦ));
    i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ += 1;
#ਜੇ_ਅੰਤ
}


#ਜੇ d_m3_ਰਿਕਾਰਡ_Backtraces
ਖਾਲੀ Emit_Mapping_ਇੰਦਰਾਜ (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, u32 i_module_ਵਿੱਥ)
{
    M3_ਕੋਡ_Mapping_ਪੰਨਾ* ਪੰਨਾ = i_ਪੰਨਾ->info.mapping;
                                                                        d_m3Assert (ਪੰਨਾ->ਮਾਪ < ਪੰਨਾ->ਸਮਰੱਥਾ);

    M3_ਕੋਡ_Map_ਇੰਦਰਾਜ* ਇੰਦਰਾਜ = &ਪੰਨਾ->entries[ਪੰਨਾ->ਮਾਪ++];
    pc_t            pc    = Get_ਪੰਨਾ_PC(i_ਪੰਨਾ);

    ਇੰਦਰਾਜ->pc_ਵਿੱਥ     = (u32)(pc - ਪੰਨਾ->ਅਧਾਰ_PC);
    ਇੰਦਰਾਜ->module_ਵਿੱਥ = i_module_ਵਿੱਥ;
}
#ਜੇ_ਅੰਤ // d_m3RecordBacktraces

pc_t Get_ਪੰਨਾ_ਸ਼ੁਰੂ_PC (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ)
{
    ਵਾਪਸ &i_ਪੰਨਾ->ਕੋਡ[0];
}


pc_t Get_ਪੰਨਾ_PC (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ)
{
    ਜੇ (i_ਪੰਨਾ) {
        ਵਾਪਸ &i_ਪੰਨਾ->ਕੋਡ[i_ਪੰਨਾ->info.ਸਤਰ_ਸੂਚਕਾਂਕ];
    } ਨਹੀਂਤਾਂ {
        ਵਾਪਸ ਨਿਰਾ;
    }
}


ਖਾਲੀ ਧੱਕੋ_ਕੋਡ_ਪੰਨਾ (IM3_ਕੋਡ_ਪੰਨਾ* i_list, IM3_ਕੋਡ_ਪੰਨਾ i_ਕੋਡ_ਪੰਨਾ)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਅਗਲਾ      = *i_list;
    i_ਕੋਡ_ਪੰਨਾ->info.ਅਗਲਾ = ਅਗਲਾ;
    *i_list               = i_ਕੋਡ_ਪੰਨਾ;
}


IM3_ਕੋਡ_ਪੰਨਾ ਕੱਢੋ_ਕੋਡ_ਪੰਨਾ (IM3_ਕੋਡ_ਪੰਨਾ* i_list)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਪੰਨਾ = *i_list;
    *i_list          = ਪੰਨਾ->info.ਅਗਲਾ;
    ਪੰਨਾ->info.ਅਗਲਾ  = ਨਿਰਾ;

    ਵਾਪਸ ਪੰਨਾ;
}


u32 ਲੱਭੋ_ਕੋਡ_ਪੰਨਾ_ਸਿਰਾ (IM3_ਕੋਡ_ਪੰਨਾ i_list, IM3_ਕੋਡ_ਪੰਨਾ* o_ਸਿਰਾ)
{
    u32 ਅੰਕ_ਪੰਨੇ = 0;
    *o_ਸਿਰਾ       = ਨਿਰਾ;

    ਜਦੋਂ (i_list) {
        *o_ਸਿਰਾ = i_list;
        ++ਅੰਕ_ਪੰਨੇ;
        i_list = i_list->info.ਅਗਲਾ;
    }

    ਵਾਪਸ ਅੰਕ_ਪੰਨੇ;
}


u32 ਗਿਣਤੀ_ਕੋਡ_ਪੰਨੇ (IM3_ਕੋਡ_ਪੰਨਾ i_list)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਅਣਵਰਤਿਆ;
    ਵਾਪਸ ਲੱਭੋ_ਕੋਡ_ਪੰਨਾ_ਸਿਰਾ(i_list, &ਅਣਵਰਤਿਆ);
}


IM3_ਕੋਡ_ਪੰਨਾ Get_ਸਿਰਾ_ਕੋਡ_ਪੰਨਾ (IM3_ਕੋਡ_ਪੰਨਾ i_list)
{
    IM3_ਕੋਡ_ਪੰਨਾ ਸਿਰਾ;
    ਲੱਭੋ_ਕੋਡ_ਪੰਨਾ_ਸਿਰਾ(i_list, &ਸਿਰਾ);

    ਵਾਪਸ ਸਿਰਾ;
}

#ਜੇ d_m3_ਰਿਕਾਰਡ_Backtraces
bool ਸ਼ਾਮਲ_ਹੈ_PC (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, pc_t i_pc)
{
    ਵਾਪਸ Get_ਪੰਨਾ_ਸ਼ੁਰੂ_PC(i_ਪੰਨਾ) <= i_pc && i_pc < Get_ਪੰਨਾ_PC(i_ਪੰਨਾ);
}


bool Map_PCTo_ਵਿੱਥ (IM3_ਕੋਡ_ਪੰਨਾ i_ਪੰਨਾ, pc_t i_pc, u32* o_module_ਵਿੱਥ)
{
    M3_ਕੋਡ_Mapping_ਪੰਨਾ* mapping = i_ਪੰਨਾ->info.mapping;

    u32 pc_ਵਿੱਥ = (u32)(i_pc - mapping->ਅਧਾਰ_PC);

    u32 ਖੱਬਾ  = 0;
    u32 ਸੱਜਾ = mapping->ਮਾਪ;

    ਜਦੋਂ (ਖੱਬਾ < ਸੱਜਾ) {
        u32 mid = ਖੱਬਾ + (ਸੱਜਾ - ਖੱਬਾ) / 2;

        ਜੇ (mapping->entries[mid].pc_ਵਿੱਥ < pc_ਵਿੱਥ) {
            ਖੱਬਾ = mid + 1;
        } ਨਹੀਂਤਾਂ ਜੇ (mapping->entries[mid].pc_ਵਿੱਥ > pc_ਵਿੱਥ) {
            ਸੱਜਾ = mid;
        } ਨਹੀਂਤਾਂ {
            *o_module_ਵਿੱਥ = mapping->entries[mid].module_ਵਿੱਥ;
            ਵਾਪਸ true;
        }
    }

    // Getting here means left is now one more than the element we want.
    ਜੇ (ਖੱਬਾ > 0) {
        ਖੱਬਾ--;
        *o_module_ਵਿੱਥ = mapping->entries[ਖੱਬਾ].module_ਵਿੱਥ;
        ਵਾਪਸ true;
    } ਨਹੀਂਤਾਂ {
        ਵਾਪਸ false;
    }
}
#ਜੇ_ਅੰਤ // d_m3RecordBacktraces

//---------------------------------------------------------------------------------------------------------------------------------
