//
//  m3_code.c
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#అన్తర్భావ <limits.h>
#అన్తర్భావ "m3_code.h"
#అన్తర్భావ "m3_env.h"

//---------------------------------------------------------------------------------------------------------------------------------


IM3_సంకేతం_పుట New_సంకేతం_పుట (IM3Runtime i_runtime, u32 i_min_అంకె_పంక్తులు)
{
    IM3_సంకేతం_పుట పుట;

    // check multiplication overflow
    ఒకవేళ (i_min_అంకె_పంక్తులు > UINT_MAX / పరిమాణం(సంకేతం_t)) {
        తిరిగి ఖాళీ;
    }
    u32 పుట_కొలత = పరిమాణం(M3_సంకేతం_పుట_శీర్షిక) + పరిమాణం(సంకేతం_t) * i_min_అంకె_పంక్తులు;

    // check addition overflow
    ఒకవేళ (పుట_కొలత < పరిమాణం(M3_సంకేతం_పుట_శీర్షిక)) {
        తిరిగి ఖాళీ;
    }

    పుట_కొలత = (పుట_కొలత + (d_m3_సంకేతం_పుట_Align_కొలత - 1)) & ~(d_m3_సంకేతం_పుట_Align_కొలత - 1); // align
    // check alignment overflow
    ఒకవేళ (పుట_కొలత == 0) {
        తిరిగి ఖాళీ;
    }

    పుట = (IM3_సంకేతం_పుట)m3_Malloc("M3CodePage", పుట_కొలత);

    ఒకవేళ (పుట) {
        పుట->info.sequence = ++i_runtime->new_సంకేతం_పుట_Sequence;
        పుట->info.అంకె_పంక్తులు = (పుట_కొలత - పరిమాణం(M3_సంకేతం_పుట_శీర్షిక)) / పరిమాణం(సంకేతం_t);

#ఒకవేళ d_m3_రికార్డు_Backtraces
        u32 పుట_కొలత_Bt     = పరిమాణం(M3_సంకేతం_Mapping_పుట) + పరిమాణం(M3_సంకేతం_Map_నమోదు) * పుట->info.అంకె_పంక్తులు;
        పుట->info.mapping = (M3_సంకేతం_Mapping_పుట*)m3_Malloc("M3CodeMappingPage", పుట_కొలత_Bt);

        ఒకవేళ (పుట->info.mapping) {
            పుట->info.mapping->కొలత     = 0;
            పుట->info.mapping->సామర్థ్యం = పుట->info.అంకె_పంక్తులు;
        } లేకపోతే {
            m3_Free(పుట);
            తిరిగి ఖాళీ;
        }
        పుట->info.mapping->పునాది_PC = Get_పుట_ప్రారంభం_PC(పుట);
#అయితే_ముగింపు // d_m3RecordBacktraces

        m3log(runtime, "new page: %p; seq: %d; bytes: %d; lines: %d", Get_పుట_PC(పుట), పుట->info.sequence, పుట_కొలత, పుట->info.అంకె_పంక్తులు);
    }

    తిరిగి పుట;
}


శూన్య Free_సంకేతం_పుటలు (IM3_సంకేతం_పుట* io_list)
{
    IM3_సంకేతం_పుట పుట = *io_list;

    అయితే (పుట) {
        m3log(సంకేతం_2, "free page: %d; %p; util: %3.1f%%", పుట->info.sequence, పుట, 100. * పుట->info.పంక్తి_సూచీ / పుట->info.అంకె_పంక్తులు);

        IM3_సంకేతం_పుట తదుపరి = పుట->info.తదుపరి;
#ఒకవేళ d_m3_రికార్డు_Backtraces
        m3_Free(పుట->info.mapping);
#అయితే_ముగింపు // d_m3RecordBacktraces
        m3_Free(పుట);
        పుట = తదుపరి;
    }

    *io_list = ఖాళీ;
}


u32 అంకె_Free_పంక్తులు (IM3_సంకేతం_పుట i_పుట)
{
    d_m3Assert(i_పుట->info.పంక్తి_సూచీ <= i_పుట->info.అంకె_పంక్తులు);

    తిరిగి i_పుట->info.అంకె_పంక్తులు - i_పుట->info.పంక్తి_సూచీ;
}


శూన్య Emit_మాట_impl (IM3_సంకేతం_పుట i_పుట, శూన్య* i_మాట)
{                                                                       d_m3Assert (i_పుట->info.పంక్తి_సూచీ+1 <= i_పుట->info.అంకె_పంక్తులు);
    i_పుట->సంకేతం_2[i_పుట->info.పంక్తి_సూచీ++] = i_మాట;
}

శూన్య EmitWord32 (IM3_సంకేతం_పుట i_పుట, స్థిరరాశి u32 i_మాట)
{                                                                       d_m3Assert (i_పుట->info.పంక్తి_సూచీ+1 <= i_పుట->info.అంకె_పంక్తులు);
    జ్ఞాపకం_నకలు(&i_పుట->సంకేతం_2[i_పుట->info.పంక్తి_సూచీ++], &i_మాట, పరిమాణం(i_మాట));
}

శూన్య EmitWord64 (IM3_సంకేతం_పుట i_పుట, స్థిరరాశి u64 i_మాట)
{
#ఒకవేళ M3_SIZEOF_PTR == 4
                                                                        d_m3Assert (i_పుట->info.పంక్తి_సూచీ+2 <= i_పుట->info.అంకె_పంక్తులు);
    జ్ఞాపకం_నకలు(&i_పుట->సంకేతం_2[i_పుట->info.పంక్తి_సూచీ], &i_మాట, పరిమాణం(i_మాట));
    i_పుట->info.పంక్తి_సూచీ += 2;
#లేకపోతే
                                                                        d_m3Assert (i_పుట->info.పంక్తి_సూచీ+1 <= i_పుట->info.అంకె_పంక్తులు);
    జ్ఞాపకం_నకలు(&i_పుట->సంకేతం_2[i_పుట->info.పంక్తి_సూచీ], &i_మాట, పరిమాణం(i_మాట));
    i_పుట->info.పంక్తి_సూచీ += 1;
#అయితే_ముగింపు
}


#ఒకవేళ d_m3_రికార్డు_Backtraces
శూన్య Emit_Mapping_నమోదు (IM3_సంకేతం_పుట i_పుట, u32 i_module_స్థానభ్రంశం)
{
    M3_సంకేతం_Mapping_పుట* పుట = i_పుట->info.mapping;
                                                                        d_m3Assert (పుట->కొలత < పుట->సామర్థ్యం);

    M3_సంకేతం_Map_నమోదు* నమోదు_2 = &పుట->entries[పుట->కొలత++];
    pc_t            pc    = Get_పుట_PC(i_పుట);

    నమోదు_2->pc_స్థానభ్రంశం     = (u32)(pc - పుట->పునాది_PC);
    నమోదు_2->module_స్థానభ్రంశం = i_module_స్థానభ్రంశం;
}
#అయితే_ముగింపు // d_m3RecordBacktraces

pc_t Get_పుట_ప్రారంభం_PC (IM3_సంకేతం_పుట i_పుట)
{
    తిరిగి &i_పుట->సంకేతం_2[0];
}


pc_t Get_పుట_PC (IM3_సంకేతం_పుట i_పుట)
{
    ఒకవేళ (i_పుట) {
        తిరిగి &i_పుట->సంకేతం_2[i_పుట->info.పంక్తి_సూచీ];
    } లేకపోతే {
        తిరిగి ఖాళీ;
    }
}


శూన్య నెట్టు_సంకేతం_పుట (IM3_సంకేతం_పుట* i_list, IM3_సంకేతం_పుట i_సంకేతం_పుట)
{
    IM3_సంకేతం_పుట తదుపరి      = *i_list;
    i_సంకేతం_పుట->info.తదుపరి = తదుపరి;
    *i_list               = i_సంకేతం_పుట;
}


IM3_సంకేతం_పుట తీయి_సంకేతం_పుట (IM3_సంకేతం_పుట* i_list)
{
    IM3_సంకేతం_పుట పుట = *i_list;
    *i_list          = పుట->info.తదుపరి;
    పుట->info.తదుపరి  = ఖాళీ;

    తిరిగి పుట;
}


u32 కనుగొను_సంకేతం_పుట_చివర (IM3_సంకేతం_పుట i_list, IM3_సంకేతం_పుట* o_చివర)
{
    u32 అంకె_పుటలు = 0;
    *o_చివర       = ఖాళీ;

    అయితే (i_list) {
        *o_చివర = i_list;
        ++అంకె_పుటలు;
        i_list = i_list->info.తదుపరి;
    }

    తిరిగి అంకె_పుటలు;
}


u32 లెక్క_సంకేతం_పుటలు (IM3_సంకేతం_పుట i_list)
{
    IM3_సంకేతం_పుట వాడని;
    తిరిగి కనుగొను_సంకేతం_పుట_చివర(i_list, &వాడని);
}


IM3_సంకేతం_పుట Get_చివర_సంకేతం_పుట (IM3_సంకేతం_పుట i_list)
{
    IM3_సంకేతం_పుట చివర;
    కనుగొను_సంకేతం_పుట_చివర(i_list, &చివర);

    తిరిగి చివర;
}

#ఒకవేళ d_m3_రికార్డు_Backtraces
bool కలిగియుంది_PC (IM3_సంకేతం_పుట i_పుట, pc_t i_pc)
{
    తిరిగి Get_పుట_ప్రారంభం_PC(i_పుట) <= i_pc && i_pc < Get_పుట_PC(i_పుట);
}


bool Map_PCTo_స్థానభ్రంశం (IM3_సంకేతం_పుట i_పుట, pc_t i_pc, u32* o_module_స్థానభ్రంశం)
{
    M3_సంకేతం_Mapping_పుట* mapping = i_పుట->info.mapping;

    u32 pc_స్థానభ్రంశం = (u32)(i_pc - mapping->పునాది_PC);

    u32 ఎడమ  = 0;
    u32 కుడి = mapping->కొలత;

    అయితే (ఎడమ < కుడి) {
        u32 mid = ఎడమ + (కుడి - ఎడమ) / 2;

        ఒకవేళ (mapping->entries[mid].pc_స్థానభ్రంశం < pc_స్థానభ్రంశం) {
            ఎడమ = mid + 1;
        } లేకపోతే ఒకవేళ (mapping->entries[mid].pc_స్థానభ్రంశం > pc_స్థానభ్రంశం) {
            కుడి = mid;
        } లేకపోతే {
            *o_module_స్థానభ్రంశం = mapping->entries[mid].module_స్థానభ్రంశం;
            తిరిగి true;
        }
    }

    // Getting here means left is now one more than the element we want.
    ఒకవేళ (ఎడమ > 0) {
        ఎడమ--;
        *o_module_స్థానభ్రంశం = mapping->entries[ఎడమ].module_స్థానభ్రంశం;
        తిరిగి true;
    } లేకపోతే {
        తిరిగి false;
    }
}
#అయితే_ముగింపు // d_m3RecordBacktraces

//---------------------------------------------------------------------------------------------------------------------------------
