//
//  m3_code.c
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#ضمن <limits.h>
#ضمن "m3_code.h"
#ضمن "m3_env.h"

//---------------------------------------------------------------------------------------------------------------------------------


IM3_کد_صفحه New_کد_صفحه (IM3Runtime i_runtime, u32 i_min_رقم_سطرها)
{
    IM3_کد_صفحه صفحه;

    // check multiplication overflow
    إذا (i_min_رقم_سطرها > UINT_MAX / حجم(کد_t)) {
        أرجع عدم;
    }
    u32 صفحه_اندازه = حجم(M3_کد_صفحه_سرآیند) + حجم(کد_t) * i_min_رقم_سطرها;

    // check addition overflow
    إذا (صفحه_اندازه < حجم(M3_کد_صفحه_سرآیند)) {
        أرجع عدم;
    }

    صفحه_اندازه = (صفحه_اندازه + (d_m3_کد_صفحه_Align_اندازه - 1)) & ~(d_m3_کد_صفحه_Align_اندازه - 1); // align
    // check alignment overflow
    إذا (صفحه_اندازه == 0) {
        أرجع عدم;
    }

    صفحه = (IM3_کد_صفحه)m3_Malloc("M3CodePage", صفحه_اندازه);

    إذا (صفحه) {
        صفحه->info.sequence = ++i_runtime->new_کد_صفحه_Sequence;
        صفحه->info.رقم_سطرها = (صفحه_اندازه - حجم(M3_کد_صفحه_سرآیند)) / حجم(کد_t);

#إذا d_m3_رکورد_Backtraces
        u32 صفحه_اندازه_Bt     = حجم(M3_کد_Mapping_صفحه) + حجم(M3_کد_Map_مدخل) * صفحه->info.رقم_سطرها;
        صفحه->info.mapping = (M3_کد_Mapping_صفحه*)m3_Malloc("M3CodeMappingPage", صفحه_اندازه_Bt);

        إذا (صفحه->info.mapping) {
            صفحه->info.mapping->اندازه     = 0;
            صفحه->info.mapping->ظرفیت = صفحه->info.رقم_سطرها;
        } وإلا {
            m3_Free(صفحه);
            أرجع عدم;
        }
        صفحه->info.mapping->پایه_PC = Get_صفحه_شروع_PC(صفحه);
#پایان_اگر // d_m3RecordBacktraces

        m3log(runtime, "new page: %p; seq: %d; bytes: %d; lines: %d", Get_صفحه_PC(صفحه), صفحه->info.sequence, صفحه_اندازه, صفحه->info.رقم_سطرها);
    }

    أرجع صفحه;
}


فراغ Free_کد_صفحات (IM3_کد_صفحه* io_list)
{
    IM3_کد_صفحه صفحه = *io_list;

    طالما (صفحه) {
        m3log(کد, "free page: %d; %p; util: %3.1f%%", صفحه->info.sequence, صفحه, 100. * صفحه->info.سطر_شاخص / صفحه->info.رقم_سطرها);

        IM3_کد_صفحه بعدی = صفحه->info.بعدی;
#إذا d_m3_رکورد_Backtraces
        m3_Free(صفحه->info.mapping);
#پایان_اگر // d_m3RecordBacktraces
        m3_Free(صفحه);
        صفحه = بعدی;
    }

    *io_list = عدم;
}


u32 رقم_Free_سطرها (IM3_کد_صفحه i_صفحه)
{
    d_m3Assert(i_صفحه->info.سطر_شاخص <= i_صفحه->info.رقم_سطرها);

    أرجع i_صفحه->info.رقم_سطرها - i_صفحه->info.سطر_شاخص;
}


فراغ Emit_کلمه_impl (IM3_کد_صفحه i_صفحه, فراغ* i_کلمه)
{                                                                       d_m3Assert (i_صفحه->info.سطر_شاخص+1 <= i_صفحه->info.رقم_سطرها);
    i_صفحه->کد[i_صفحه->info.سطر_شاخص++] = i_کلمه;
}

فراغ EmitWord32 (IM3_کد_صفحه i_صفحه, ثابت u32 i_کلمه)
{                                                                       d_m3Assert (i_صفحه->info.سطر_شاخص+1 <= i_صفحه->info.رقم_سطرها);
    کپی_حافظه(&i_صفحه->کد[i_صفحه->info.سطر_شاخص++], &i_کلمه, حجم(i_کلمه));
}

فراغ EmitWord64 (IM3_کد_صفحه i_صفحه, ثابت u64 i_کلمه)
{
#إذا M3_SIZEOF_PTR == 4
                                                                        d_m3Assert (i_صفحه->info.سطر_شاخص+2 <= i_صفحه->info.رقم_سطرها);
    کپی_حافظه(&i_صفحه->کد[i_صفحه->info.سطر_شاخص], &i_کلمه, حجم(i_کلمه));
    i_صفحه->info.سطر_شاخص += 2;
#وإلا
                                                                        d_m3Assert (i_صفحه->info.سطر_شاخص+1 <= i_صفحه->info.رقم_سطرها);
    کپی_حافظه(&i_صفحه->کد[i_صفحه->info.سطر_شاخص], &i_کلمه, حجم(i_کلمه));
    i_صفحه->info.سطر_شاخص += 1;
#پایان_اگر
}


#إذا d_m3_رکورد_Backtraces
فراغ Emit_Mapping_مدخل (IM3_کد_صفحه i_صفحه, u32 i_module_جابه_جایی)
{
    M3_کد_Mapping_صفحه* صفحه = i_صفحه->info.mapping;
                                                                        d_m3Assert (صفحه->اندازه < صفحه->ظرفیت);

    M3_کد_Map_مدخل* مدخل = &صفحه->entries[صفحه->اندازه++];
    pc_t            pc    = Get_صفحه_PC(i_صفحه);

    مدخل->pc_جابه_جایی     = (u32)(pc - صفحه->پایه_PC);
    مدخل->module_جابه_جایی = i_module_جابه_جایی;
}
#پایان_اگر // d_m3RecordBacktraces

pc_t Get_صفحه_شروع_PC (IM3_کد_صفحه i_صفحه)
{
    أرجع &i_صفحه->کد[0];
}


pc_t Get_صفحه_PC (IM3_کد_صفحه i_صفحه)
{
    إذا (i_صفحه) {
        أرجع &i_صفحه->کد[i_صفحه->info.سطر_شاخص];
    } وإلا {
        أرجع عدم;
    }
}


فراغ افزودن_کد_صفحه (IM3_کد_صفحه* i_list, IM3_کد_صفحه i_کد_صفحه)
{
    IM3_کد_صفحه بعدی      = *i_list;
    i_کد_صفحه->info.بعدی = بعدی;
    *i_list               = i_کد_صفحه;
}


IM3_کد_صفحه برداشت_کد_صفحه (IM3_کد_صفحه* i_list)
{
    IM3_کد_صفحه صفحه = *i_list;
    *i_list          = صفحه->info.بعدی;
    صفحه->info.بعدی  = عدم;

    أرجع صفحه;
}


u32 پیدا_کن_کد_صفحه_انتها (IM3_کد_صفحه i_list, IM3_کد_صفحه* o_انتها)
{
    u32 رقم_صفحات = 0;
    *o_انتها       = عدم;

    طالما (i_list) {
        *o_انتها = i_list;
        ++رقم_صفحات;
        i_list = i_list->info.بعدی;
    }

    أرجع رقم_صفحات;
}


u32 شمار_کد_صفحات (IM3_کد_صفحه i_list)
{
    IM3_کد_صفحه استفادهنشده;
    أرجع پیدا_کن_کد_صفحه_انتها(i_list, &استفادهنشده);
}


IM3_کد_صفحه Get_انتها_کد_صفحه (IM3_کد_صفحه i_list)
{
    IM3_کد_صفحه انتها;
    پیدا_کن_کد_صفحه_انتها(i_list, &انتها);

    أرجع انتها;
}

#إذا d_m3_رکورد_Backtraces
bool شامل_است_PC (IM3_کد_صفحه i_صفحه, pc_t i_pc)
{
    أرجع Get_صفحه_شروع_PC(i_صفحه) <= i_pc && i_pc < Get_صفحه_PC(i_صفحه);
}


bool Map_PCTo_جابه_جایی (IM3_کد_صفحه i_صفحه, pc_t i_pc, u32* o_module_جابه_جایی)
{
    M3_کد_Mapping_صفحه* mapping = i_صفحه->info.mapping;

    u32 pc_جابه_جایی = (u32)(i_pc - mapping->پایه_PC);

    u32 چپ  = 0;
    u32 راست = mapping->اندازه;

    طالما (چپ < راست) {
        u32 mid = چپ + (راست - چپ) / 2;

        إذا (mapping->entries[mid].pc_جابه_جایی < pc_جابه_جایی) {
            چپ = mid + 1;
        } وإلا إذا (mapping->entries[mid].pc_جابه_جایی > pc_جابه_جایی) {
            راست = mid;
        } وإلا {
            *o_module_جابه_جایی = mapping->entries[mid].module_جابه_جایی;
            أرجع true;
        }
    }

    // Getting here means left is now one more than the element we want.
    إذا (چپ > 0) {
        چپ--;
        *o_module_جابه_جایی = mapping->entries[چپ].module_جابه_جایی;
        أرجع true;
    } وإلا {
        أرجع false;
    }
}
#پایان_اگر // d_m3RecordBacktraces

//---------------------------------------------------------------------------------------------------------------------------------
