//
//  m3_code.c
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#ضمن <limits.h>
#ضمن "m3_code.h"
#ضمن "m3_env.h"

//---------------------------------------------------------------------------------------------------------------------------------


IM3_کوډ_پاڼه New_کوډ_پاڼه (IM3Runtime i_runtime, u32 i_min_عدد_کرښې)
{
    IM3_کوډ_پاڼه پاڼه;

    // check multiplication overflow
    إذا (i_min_عدد_کرښې > UINT_MAX / حجم(کوډ_t)) {
        أرجع عدم;
    }
    u32 پاڼه_اندازه = حجم(M3_کوډ_پاڼه_سرلیک) + حجم(کوډ_t) * i_min_عدد_کرښې;

    // check addition overflow
    إذا (پاڼه_اندازه < حجم(M3_کوډ_پاڼه_سرلیک)) {
        أرجع عدم;
    }

    پاڼه_اندازه = (پاڼه_اندازه + (d_m3_کوډ_پاڼه_Align_اندازه - 1)) & ~(d_m3_کوډ_پاڼه_Align_اندازه - 1); // align
    // check alignment overflow
    إذا (پاڼه_اندازه == 0) {
        أرجع عدم;
    }

    پاڼه = (IM3_کوډ_پاڼه)m3_Malloc("M3CodePage", پاڼه_اندازه);

    إذا (پاڼه) {
        پاڼه->info.sequence = ++i_runtime->new_کوډ_پاڼه_Sequence;
        پاڼه->info.عدد_کرښې = (پاڼه_اندازه - حجم(M3_کوډ_پاڼه_سرلیک)) / حجم(کوډ_t);

#إذا d_m3_ریکارډ_Backtraces
        u32 پاڼه_اندازه_Bt     = حجم(M3_کوډ_Mapping_پاڼه) + حجم(M3_کوډ_Map_ثبت) * پاڼه->info.عدد_کرښې;
        پاڼه->info.mapping = (M3_کوډ_Mapping_پاڼه*)m3_Malloc("M3CodeMappingPage", پاڼه_اندازه_Bt);

        إذا (پاڼه->info.mapping) {
            پاڼه->info.mapping->اندازه     = 0;
            پاڼه->info.mapping->ظرفیت = پاڼه->info.عدد_کرښې;
        } وإلا {
            m3_Free(پاڼه);
            أرجع عدم;
        }
        پاڼه->info.mapping->بنسټ_PC = Get_پاڼه_پیل_PC(پاڼه);
#د_که_پای // d_m3RecordBacktraces

        m3log(runtime, "new page: %p; seq: %d; bytes: %d; lines: %d", Get_پاڼه_PC(پاڼه), پاڼه->info.sequence, پاڼه_اندازه, پاڼه->info.عدد_کرښې);
    }

    أرجع پاڼه;
}


فراغ Free_کوډ_پاڼې (IM3_کوډ_پاڼه* io_list)
{
    IM3_کوډ_پاڼه پاڼه = *io_list;

    طالما (پاڼه) {
        m3log(کوډ, "free page: %d; %p; util: %3.1f%%", پاڼه->info.sequence, پاڼه, 100. * پاڼه->info.کرښه_شاخص / پاڼه->info.عدد_کرښې);

        IM3_کوډ_پاڼه بل = پاڼه->info.بل;
#إذا d_m3_ریکارډ_Backtraces
        m3_Free(پاڼه->info.mapping);
#د_که_پای // d_m3RecordBacktraces
        m3_Free(پاڼه);
        پاڼه = بل;
    }

    *io_list = عدم;
}


u32 عدد_Free_کرښې (IM3_کوډ_پاڼه i_پاڼه)
{
    d_m3Assert(i_پاڼه->info.کرښه_شاخص <= i_پاڼه->info.عدد_کرښې);

    أرجع i_پاڼه->info.عدد_کرښې - i_پاڼه->info.کرښه_شاخص;
}


فراغ Emit_کلمه_impl (IM3_کوډ_پاڼه i_پاڼه, فراغ* i_کلمه)
{                                                                       d_m3Assert (i_پاڼه->info.کرښه_شاخص+1 <= i_پاڼه->info.عدد_کرښې);
    i_پاڼه->کوډ[i_پاڼه->info.کرښه_شاخص++] = i_کلمه;
}

فراغ EmitWord32 (IM3_کوډ_پاڼه i_پاڼه, ثابت u32 i_کلمه)
{                                                                       d_m3Assert (i_پاڼه->info.کرښه_شاخص+1 <= i_پاڼه->info.عدد_کرښې);
    حافظه_نقل(&i_پاڼه->کوډ[i_پاڼه->info.کرښه_شاخص++], &i_کلمه, حجم(i_کلمه));
}

فراغ EmitWord64 (IM3_کوډ_پاڼه i_پاڼه, ثابت u64 i_کلمه)
{
#إذا M3_SIZEOF_PTR == 4
                                                                        d_m3Assert (i_پاڼه->info.کرښه_شاخص+2 <= i_پاڼه->info.عدد_کرښې);
    حافظه_نقل(&i_پاڼه->کوډ[i_پاڼه->info.کرښه_شاخص], &i_کلمه, حجم(i_کلمه));
    i_پاڼه->info.کرښه_شاخص += 2;
#وإلا
                                                                        d_m3Assert (i_پاڼه->info.کرښه_شاخص+1 <= i_پاڼه->info.عدد_کرښې);
    حافظه_نقل(&i_پاڼه->کوډ[i_پاڼه->info.کرښه_شاخص], &i_کلمه, حجم(i_کلمه));
    i_پاڼه->info.کرښه_شاخص += 1;
#د_که_پای
}


#إذا d_m3_ریکارډ_Backtraces
فراغ Emit_Mapping_ثبت (IM3_کوډ_پاڼه i_پاڼه, u32 i_module_دننه_واټن)
{
    M3_کوډ_Mapping_پاڼه* پاڼه = i_پاڼه->info.mapping;
                                                                        d_m3Assert (پاڼه->اندازه < پاڼه->ظرفیت);

    M3_کوډ_Map_ثبت* ثبت = &پاڼه->entries[پاڼه->اندازه++];
    pc_t            pc    = Get_پاڼه_PC(i_پاڼه);

    ثبت->pc_دننه_واټن     = (u32)(pc - پاڼه->بنسټ_PC);
    ثبت->module_دننه_واټن = i_module_دننه_واټن;
}
#د_که_پای // d_m3RecordBacktraces

pc_t Get_پاڼه_پیل_PC (IM3_کوډ_پاڼه i_پاڼه)
{
    أرجع &i_پاڼه->کوډ[0];
}


pc_t Get_پاڼه_PC (IM3_کوډ_پاڼه i_پاڼه)
{
    إذا (i_پاڼه) {
        أرجع &i_پاڼه->کوډ[i_پاڼه->info.کرښه_شاخص];
    } وإلا {
        أرجع عدم;
    }
}


فراغ ټېل_کوډ_پاڼه (IM3_کوډ_پاڼه* i_list, IM3_کوډ_پاڼه i_کوډ_پاڼه)
{
    IM3_کوډ_پاڼه بل      = *i_list;
    i_کوډ_پاڼه->info.بل = بل;
    *i_list               = i_کوډ_پاڼه;
}


IM3_کوډ_پاڼه راوباسه_کوډ_پاڼه (IM3_کوډ_پاڼه* i_list)
{
    IM3_کوډ_پاڼه پاڼه = *i_list;
    *i_list          = پاڼه->info.بل;
    پاڼه->info.بل  = عدم;

    أرجع پاڼه;
}


u32 پیدا_کړه_کوډ_پاڼه_پای_ټکی (IM3_کوډ_پاڼه i_list, IM3_کوډ_پاڼه* o_پای_ټکی)
{
    u32 عدد_پاڼې = 0;
    *o_پای_ټکی       = عدم;

    طالما (i_list) {
        *o_پای_ټکی = i_list;
        ++عدد_پاڼې;
        i_list = i_list->info.بل;
    }

    أرجع عدد_پاڼې;
}


u32 شمېر_کوډ_پاڼې (IM3_کوډ_پاڼه i_list)
{
    IM3_کوډ_پاڼه ناکارول_شوی;
    أرجع پیدا_کړه_کوډ_پاڼه_پای_ټکی(i_list, &ناکارول_شوی);
}


IM3_کوډ_پاڼه Get_پای_ټکی_کوډ_پاڼه (IM3_کوډ_پاڼه i_list)
{
    IM3_کوډ_پاڼه پای_ټکی;
    پیدا_کړه_کوډ_پاڼه_پای_ټکی(i_list, &پای_ټکی);

    أرجع پای_ټکی;
}

#إذا d_m3_ریکارډ_Backtraces
bool لري_PC (IM3_کوډ_پاڼه i_پاڼه, pc_t i_pc)
{
    أرجع Get_پاڼه_پیل_PC(i_پاڼه) <= i_pc && i_pc < Get_پاڼه_PC(i_پاڼه);
}


bool Map_PCTo_دننه_واټن (IM3_کوډ_پاڼه i_پاڼه, pc_t i_pc, u32* o_module_دننه_واټن)
{
    M3_کوډ_Mapping_پاڼه* mapping = i_پاڼه->info.mapping;

    u32 pc_دننه_واټن = (u32)(i_pc - mapping->بنسټ_PC);

    u32 کیڼ  = 0;
    u32 ښی = mapping->اندازه;

    طالما (کیڼ < ښی) {
        u32 mid = کیڼ + (ښی - کیڼ) / 2;

        إذا (mapping->entries[mid].pc_دننه_واټن < pc_دننه_واټن) {
            کیڼ = mid + 1;
        } وإلا إذا (mapping->entries[mid].pc_دننه_واټن > pc_دننه_واټن) {
            ښی = mid;
        } وإلا {
            *o_module_دننه_واټن = mapping->entries[mid].module_دننه_واټن;
            أرجع true;
        }
    }

    // Getting here means left is now one more than the element we want.
    إذا (کیڼ > 0) {
        کیڼ--;
        *o_module_دننه_واټن = mapping->entries[کیڼ].module_دننه_واټن;
        أرجع true;
    } وإلا {
        أرجع false;
    }
}
#د_که_پای // d_m3RecordBacktraces

//---------------------------------------------------------------------------------------------------------------------------------
