//
//  m3_code.c
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#ಅನ್ತರ್ಭಾವ <limits.h>
#ಅನ್ತರ್ಭಾವ "m3_code.h"
#ಅನ್ತರ್ಭಾವ "m3_env.h"

//---------------------------------------------------------------------------------------------------------------------------------


IM3_ಸಂಕೇತ_ಪುಟ New_ಸಂಕೇತ_ಪುಟ (IM3Runtime i_runtime, u32 i_min_ಅಂಕೆ_ಸಾಲುಗಳು)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಪುಟ;

    // check multiplication overflow
    ಆದರೆ (i_min_ಅಂಕೆ_ಸಾಲುಗಳು > UINT_MAX / ಗಾತ್ರ(ಸಂಕೇತ_t)) {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }
    u32 ಪುಟ_ಗಾತ್ರ = ಗಾತ್ರ(M3_ಸಂಕೇತ_ಪುಟ_ಶೀರ್ಷಿಕೆ) + ಗಾತ್ರ(ಸಂಕೇತ_t) * i_min_ಅಂಕೆ_ಸಾಲುಗಳು;

    // check addition overflow
    ಆದರೆ (ಪುಟ_ಗಾತ್ರ < ಗಾತ್ರ(M3_ಸಂಕೇತ_ಪುಟ_ಶೀರ್ಷಿಕೆ)) {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }

    ಪುಟ_ಗಾತ್ರ = (ಪುಟ_ಗಾತ್ರ + (d_m3_ಸಂಕೇತ_ಪುಟ_Align_ಗಾತ್ರ - 1)) & ~(d_m3_ಸಂಕೇತ_ಪುಟ_Align_ಗಾತ್ರ - 1); // align
    // check alignment overflow
    ಆದರೆ (ಪುಟ_ಗಾತ್ರ == 0) {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }

    ಪುಟ = (IM3_ಸಂಕೇತ_ಪುಟ)m3_Malloc("M3CodePage", ಪುಟ_ಗಾತ್ರ);

    ಆದರೆ (ಪುಟ) {
        ಪುಟ->info.sequence = ++i_runtime->new_ಸಂಕೇತ_ಪುಟ_Sequence;
        ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು = (ಪುಟ_ಗಾತ್ರ - ಗಾತ್ರ(M3_ಸಂಕೇತ_ಪುಟ_ಶೀರ್ಷಿಕೆ)) / ಗಾತ್ರ(ಸಂಕೇತ_t);

#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
        u32 ಪುಟ_ಗಾತ್ರ_Bt     = ಗಾತ್ರ(M3_ಸಂಕೇತ_Mapping_ಪುಟ) + ಗಾತ್ರ(M3_ಸಂಕೇತ_Map_ನಮೂದು) * ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು;
        ಪುಟ->info.mapping = (M3_ಸಂಕೇತ_Mapping_ಪುಟ*)m3_Malloc("M3CodeMappingPage", ಪುಟ_ಗಾತ್ರ_Bt);

        ಆದರೆ (ಪುಟ->info.mapping) {
            ಪುಟ->info.mapping->ಗಾತ್ರ_2     = 0;
            ಪುಟ->info.mapping->ಸಾಮರ್ಥ್ಯ = ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು;
        } ಇಲ್ಲದಿದ್ದರೆ {
            m3_Free(ಪುಟ);
            ಹಿಂತಿರುಗಿ ಖಾಲಿ;
        }
        ಪುಟ->info.mapping->ತಳ_PC = Get_ಪುಟ_ಆರಂಭ_PC(ಪುಟ);
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

        m3log(runtime, "new page: %p; seq: %d; bytes: %d; lines: %d", Get_ಪುಟ_PC(ಪುಟ), ಪುಟ->info.sequence, ಪುಟ_ಗಾತ್ರ, ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);
    }

    ಹಿಂತಿರುಗಿ ಪುಟ;
}


ಶೂನ್ಯ Free_ಸಂಕೇತ_ಪುಟಗಳು (IM3_ಸಂಕೇತ_ಪುಟ* io_list)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಪುಟ = *io_list;

    ಆಗ (ಪುಟ) {
        m3log(ಸಂಕೇತ_2, "free page: %d; %p; util: %3.1f%%", ಪುಟ->info.sequence, ಪುಟ, 100. * ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ / ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);

        IM3_ಸಂಕೇತ_ಪುಟ ಮುಂದಿನ = ಪುಟ->info.ಮುಂದಿನ;
#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
        m3_Free(ಪುಟ->info.mapping);
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces
        m3_Free(ಪುಟ);
        ಪುಟ = ಮುಂದಿನ;
    }

    *io_list = ಖಾಲಿ;
}


u32 ಅಂಕೆ_Free_ಸಾಲುಗಳು (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ)
{
    d_m3Assert(i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ <= i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);

    ಹಿಂತಿರುಗಿ i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು - i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ;
}


ಶೂನ್ಯ Emit_ಶಬ್ದ_impl (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, ಶೂನ್ಯ* i_ಶಬ್ದ)
{                                                                       d_m3Assert (i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ+1 <= i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);
    i_ಪುಟ->ಸಂಕೇತ_2[i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ++] = i_ಶಬ್ದ;
}

ಶೂನ್ಯ EmitWord32 (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, ಸ್ಥಿರಾಂಕ u32 i_ಶಬ್ದ)
{                                                                       d_m3Assert (i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ+1 <= i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);
    ಸ್ಮರಣೆ_ನಕಲು(&i_ಪುಟ->ಸಂಕೇತ_2[i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ++], &i_ಶಬ್ದ, ಗಾತ್ರ(i_ಶಬ್ದ));
}

ಶೂನ್ಯ EmitWord64 (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, ಸ್ಥಿರಾಂಕ u64 i_ಶಬ್ದ)
{
#ಆದರೆ M3_SIZEOF_PTR == 4
                                                                        d_m3Assert (i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ+2 <= i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);
    ಸ್ಮರಣೆ_ನಕಲು(&i_ಪುಟ->ಸಂಕೇತ_2[i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ], &i_ಶಬ್ದ, ಗಾತ್ರ(i_ಶಬ್ದ));
    i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ += 2;
#ಇಲ್ಲದಿದ್ದರೆ
                                                                        d_m3Assert (i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ+1 <= i_ಪುಟ->info.ಅಂಕೆ_ಸಾಲುಗಳು);
    ಸ್ಮರಣೆ_ನಕಲು(&i_ಪುಟ->ಸಂಕೇತ_2[i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ], &i_ಶಬ್ದ, ಗಾತ್ರ(i_ಶಬ್ದ));
    i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ += 1;
#ಆದರೆ_ಅಂತ್ಯ
}


#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
ಶೂನ್ಯ Emit_Mapping_ನಮೂದು (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, u32 i_module_ಸ್ಥಾನಾಂತರ)
{
    M3_ಸಂಕೇತ_Mapping_ಪುಟ* ಪುಟ = i_ಪುಟ->info.mapping;
                                                                        d_m3Assert (ಪುಟ->ಗಾತ್ರ_2 < ಪುಟ->ಸಾಮರ್ಥ್ಯ);

    M3_ಸಂಕೇತ_Map_ನಮೂದು* ನಮೂದು = &ಪುಟ->entries[ಪುಟ->ಗಾತ್ರ_2++];
    pc_t            pc    = Get_ಪುಟ_PC(i_ಪುಟ);

    ನಮೂದು->pc_ಸ್ಥಾನಾಂತರ     = (u32)(pc - ಪುಟ->ತಳ_PC);
    ನಮೂದು->module_ಸ್ಥಾನಾಂತರ = i_module_ಸ್ಥಾನಾಂತರ;
}
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

pc_t Get_ಪುಟ_ಆರಂಭ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ)
{
    ಹಿಂತಿರುಗಿ &i_ಪುಟ->ಸಂಕೇತ_2[0];
}


pc_t Get_ಪುಟ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ)
{
    ಆದರೆ (i_ಪುಟ) {
        ಹಿಂತಿರುಗಿ &i_ಪುಟ->ಸಂಕೇತ_2[i_ಪುಟ->info.ಸಾಲು_ಸೂಚ್ಯಂಕ];
    } ಇಲ್ಲದಿದ್ದರೆ {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }
}


ಶೂನ್ಯ ತಳ್ಳು_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ* i_list, IM3_ಸಂಕೇತ_ಪುಟ i_ಸಂಕೇತ_ಪುಟ)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಮುಂದಿನ      = *i_list;
    i_ಸಂಕೇತ_ಪುಟ->info.ಮುಂದಿನ = ಮುಂದಿನ;
    *i_list               = i_ಸಂಕೇತ_ಪುಟ;
}


IM3_ಸಂಕೇತ_ಪುಟ ತೆಗೆ_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ* i_list)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಪುಟ = *i_list;
    *i_list          = ಪುಟ->info.ಮುಂದಿನ;
    ಪುಟ->info.ಮುಂದಿನ  = ಖಾಲಿ;

    ಹಿಂತಿರುಗಿ ಪುಟ;
}


u32 ಕಂಡುಹಿಡಿ_ಸಂಕೇತ_ಪುಟ_ಕೊನೆ (IM3_ಸಂಕೇತ_ಪುಟ i_list, IM3_ಸಂಕೇತ_ಪುಟ* o_ಕೊನೆ)
{
    u32 ಅಂಕೆ_ಪುಟಗಳು = 0;
    *o_ಕೊನೆ       = ಖಾಲಿ;

    ಆಗ (i_list) {
        *o_ಕೊನೆ = i_list;
        ++ಅಂಕೆ_ಪುಟಗಳು;
        i_list = i_list->info.ಮುಂದಿನ;
    }

    ಹಿಂತಿರುಗಿ ಅಂಕೆ_ಪುಟಗಳು;
}


u32 ಎಣಿಕೆ_ಸಂಕೇತ_ಪುಟಗಳು (IM3_ಸಂಕೇತ_ಪುಟ i_list)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಬಳಸದ;
    ಹಿಂತಿರುಗಿ ಕಂಡುಹಿಡಿ_ಸಂಕೇತ_ಪುಟ_ಕೊನೆ(i_list, &ಬಳಸದ);
}


IM3_ಸಂಕೇತ_ಪುಟ Get_ಕೊನೆ_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ i_list)
{
    IM3_ಸಂಕೇತ_ಪುಟ ಕೊನೆ;
    ಕಂಡುಹಿಡಿ_ಸಂಕೇತ_ಪುಟ_ಕೊನೆ(i_list, &ಕೊನೆ);

    ಹಿಂತಿರುಗಿ ಕೊನೆ;
}

#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
bool ಒಳಗೊಂಡಿದೆ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, pc_t i_pc)
{
    ಹಿಂತಿರುಗಿ Get_ಪುಟ_ಆರಂಭ_PC(i_ಪುಟ) <= i_pc && i_pc < Get_ಪುಟ_PC(i_ಪುಟ);
}


bool Map_PCTo_ಸ್ಥಾನಾಂತರ (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, pc_t i_pc, u32* o_module_ಸ್ಥಾನಾಂತರ)
{
    M3_ಸಂಕೇತ_Mapping_ಪುಟ* mapping = i_ಪುಟ->info.mapping;

    u32 pc_ಸ್ಥಾನಾಂತರ = (u32)(i_pc - mapping->ತಳ_PC);

    u32 ಎಡ  = 0;
    u32 ಬಲ = mapping->ಗಾತ್ರ_2;

    ಆಗ (ಎಡ < ಬಲ) {
        u32 mid = ಎಡ + (ಬಲ - ಎಡ) / 2;

        ಆದರೆ (mapping->entries[mid].pc_ಸ್ಥಾನಾಂತರ < pc_ಸ್ಥಾನಾಂತರ) {
            ಎಡ = mid + 1;
        } ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (mapping->entries[mid].pc_ಸ್ಥಾನಾಂತರ > pc_ಸ್ಥಾನಾಂತರ) {
            ಬಲ = mid;
        } ಇಲ್ಲದಿದ್ದರೆ {
            *o_module_ಸ್ಥಾನಾಂತರ = mapping->entries[mid].module_ಸ್ಥಾನಾಂತರ;
            ಹಿಂತಿರುಗಿ true;
        }
    }

    // Getting here means left is now one more than the element we want.
    ಆದರೆ (ಎಡ > 0) {
        ಎಡ--;
        *o_module_ಸ್ಥಾನಾಂತರ = mapping->entries[ಎಡ].module_ಸ್ಥಾನಾಂತರ;
        ಹಿಂತಿರುಗಿ true;
    } ಇಲ್ಲದಿದ್ದರೆ {
        ಹಿಂತಿರುಗಿ false;
    }
}
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

//---------------------------------------------------------------------------------------------------------------------------------
