//
//  m3_code.h
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#నిర్వచితం_కాకపోతే m3_సంకేతం_h
#నిర్వచించు m3_సంకేతం_h

#అన్తర్భావ "m3_core.h"

d_m3BeginExternC

రకనిర్వచనం నిర్మాణం M3_సంకేతం_పుట {
    M3_సంకేతం_పుట_శీర్షిక info;
    సంకేతం_t           సంకేతం_2[1];
} M3_సంకేతం_పుట;

రకనిర్వచనం M3_సంకేతం_పుట* IM3_సంకేతం_పుట;


IM3_సంకేతం_పుట         New_సంకేతం_పుట (IM3Runtime i_runtime, u32 i_min_అంకె_పంక్తులు);

శూన్య                Free_సంకేతం_పుటలు (IM3_సంకేతం_పుట* io_list);

u32                 అంకె_Free_పంక్తులు (IM3_సంకేతం_పుట i_పుట);
pc_t                Get_పుట_ప్రారంభం_PC (IM3_సంకేతం_పుట i_పుట);
pc_t                Get_పుట_PC (IM3_సంకేతం_పుట i_పుట);
శూన్య                Emit_మాట_impl (IM3_సంకేతం_పుట i_పుట, శూన్య* i_మాట);
శూన్య                EmitWord32 (IM3_సంకేతం_పుట i_పుట, u32 i_మాట);
శూన్య                EmitWord64 (IM3_సంకేతం_పుట i_పుట, u64 i_మాట);
#ఒకవేళ d_m3_రికార్డు_Backtraces
శూన్య Emit_Mapping_నమోదు (IM3_సంకేతం_పుట i_పుట, u32 i_module_స్థానభ్రంశం);
#అయితే_ముగింపు // d_m3RecordBacktraces

శూన్య        నెట్టు_సంకేతం_పుట (IM3_సంకేతం_పుట* io_list, IM3_సంకేతం_పుట i_సంకేతం_పుట);
IM3_సంకేతం_పుట తీయి_సంకేతం_పుట (IM3_సంకేతం_పుట* io_list);

IM3_సంకేతం_పుట Get_చివర_సంకేతం_పుట (IM3_సంకేతం_పుట i_list); // i_list = NULL is valid
u32         లెక్క_సంకేతం_పుటలు (IM3_సంకేతం_పుట i_list); // i_list = NULL is valid

#ఒకవేళ d_m3_రికార్డు_Backtraces
bool కలిగియుంది_PC (IM3_సంకేతం_పుట i_పుట, pc_t i_pc);
bool Map_PCTo_స్థానభ్రంశం (IM3_సంకేతం_పుట i_పుట, pc_t i_pc, u32* o_module_స్థానభ్రంశం);
#అయితే_ముగింపు // d_m3RecordBacktraces

#నిర్వచితమైతే DEBUG
శూన్య dump_సంకేతం_పుట (IM3_సంకేతం_పుట i_సంకేతం_పుట, pc_t i_ప్రారంభం_PC);
#అయితే_ముగింపు

#నిర్వచించు Emit_మాట(పుట, val) Emit_మాట_impl(పుట, (శూన్య*)(val))

//---------------------------------------------------------------------------------------------------------------------------------

#ఒకవేళ d_m3_రికార్డు_Backtraces

రకనిర్వచనం నిర్మాణం M3_సంకేతం_Map_నమోదు {
    u32 pc_స్థానభ్రంశం;
    u32 module_స్థానభ్రంశం;
} M3_సంకేతం_Map_నమోదు;

రకనిర్వచనం నిర్మాణం M3_సంకేతం_Mapping_పుట {
    pc_t           పునాది_PC;
    u32            కొలత;
    u32            సామర్థ్యం;
    M3_సంకేతం_Map_నమోదు entries[];
} M3_సంకేతం_Mapping_పుట;

#అయితే_ముగింపు // d_m3RecordBacktraces

d_m3_చివర_Extern_C

#అయితే_ముగింపు // m3_code_h
