//
//  m3_code.h
//
//  Created by Steven Massey on 4/19/19.
//  Copyright © 2019 Steven Massey. All rights reserved.
//

#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ m3_ಸಂಕೇತ_h
#ವ್ಯಾಖ್ಯಾನಿಸು m3_ಸಂಕೇತ_h

#ಅನ್ತರ್ಭಾವ "m3_core.h"

d_m3BeginExternC

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ M3_ಸಂಕೇತ_ಪುಟ {
    M3_ಸಂಕೇತ_ಪುಟ_ಶೀರ್ಷಿಕೆ info;
    ಸಂಕೇತ_t           ಸಂಕೇತ_2[1];
} M3_ಸಂಕೇತ_ಪುಟ;

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ M3_ಸಂಕೇತ_ಪುಟ* IM3_ಸಂಕೇತ_ಪುಟ;


IM3_ಸಂಕೇತ_ಪುಟ         New_ಸಂಕೇತ_ಪುಟ (IM3Runtime i_runtime, u32 i_min_ಅಂಕೆ_ಸಾಲುಗಳು);

ಶೂನ್ಯ                Free_ಸಂಕೇತ_ಪುಟಗಳು (IM3_ಸಂಕೇತ_ಪುಟ* io_list);

u32                 ಅಂಕೆ_Free_ಸಾಲುಗಳು (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ);
pc_t                Get_ಪುಟ_ಆರಂಭ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ);
pc_t                Get_ಪುಟ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ);
ಶೂನ್ಯ                Emit_ಶಬ್ದ_impl (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, ಶೂನ್ಯ* i_ಶಬ್ದ);
ಶೂನ್ಯ                EmitWord32 (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, u32 i_ಶಬ್ದ);
ಶೂನ್ಯ                EmitWord64 (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, u64 i_ಶಬ್ದ);
#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
ಶೂನ್ಯ Emit_Mapping_ನಮೂದು (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, u32 i_module_ಸ್ಥಾನಾಂತರ);
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

ಶೂನ್ಯ        ತಳ್ಳು_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ* io_list, IM3_ಸಂಕೇತ_ಪುಟ i_ಸಂಕೇತ_ಪುಟ);
IM3_ಸಂಕೇತ_ಪುಟ ತೆಗೆ_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ* io_list);

IM3_ಸಂಕೇತ_ಪುಟ Get_ಕೊನೆ_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ i_list); // i_list = NULL is valid
u32         ಎಣಿಕೆ_ಸಂಕೇತ_ಪುಟಗಳು (IM3_ಸಂಕೇತ_ಪುಟ i_list); // i_list = NULL is valid

#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces
bool ಒಳಗೊಂಡಿದೆ_PC (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, pc_t i_pc);
bool Map_PCTo_ಸ್ಥಾನಾಂತರ (IM3_ಸಂಕೇತ_ಪುಟ i_ಪುಟ, pc_t i_pc, u32* o_module_ಸ್ಥಾನಾಂತರ);
#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ DEBUG
ಶೂನ್ಯ dump_ಸಂಕೇತ_ಪುಟ (IM3_ಸಂಕೇತ_ಪುಟ i_ಸಂಕೇತ_ಪುಟ, pc_t i_ಆರಂಭ_PC);
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು Emit_ಶಬ್ದ(ಪುಟ, val) Emit_ಶಬ್ದ_impl(ಪುಟ, (ಶೂನ್ಯ*)(val))

//---------------------------------------------------------------------------------------------------------------------------------

#ಆದರೆ d_m3_ದಾಖಲೆ_Backtraces

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ M3_ಸಂಕೇತ_Map_ನಮೂದು {
    u32 pc_ಸ್ಥಾನಾಂತರ;
    u32 module_ಸ್ಥಾನಾಂತರ;
} M3_ಸಂಕೇತ_Map_ನಮೂದು;

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ M3_ಸಂಕೇತ_Mapping_ಪುಟ {
    pc_t           ತಳ_PC;
    u32            ಗಾತ್ರ_2;
    u32            ಸಾಮರ್ಥ್ಯ;
    M3_ಸಂಕೇತ_Map_ನಮೂದು entries[];
} M3_ಸಂಕೇತ_Mapping_ಪುಟ;

#ಆದರೆ_ಅಂತ್ಯ // d_m3RecordBacktraces

d_m3_ಕೊನೆ_Extern_C

#ಆದರೆ_ಅಂತ್ಯ // m3_code_h
